test/Malle/LES_3D/0.orig/rans/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 30;

boundaryField
{
    wallTube
    {
        type            kqRWallFunction;
        value           uniform 30;
    }

    wallRim
    {
        type            kqRWallFunction;
        value           uniform 30;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 30;
        value           uniform 30;
    }

    inletPilot
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0628;
        value           uniform 1;
    }

    inletAir
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0471;
        value           uniform 1;
    }

    wallOutside
    {
        type            kqRWallFunction;
        value           uniform 30;
    }

    axis
    {
        type            symmetryPlane;
    }

    inletCH4
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0458;
        value           uniform 1;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
