test/Malle/LES_3D/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//simulationType      laminar;
/*
simulationType      RAS;

RAS
{
    RASModel        kEpsilon;

    turbulence      on;

    printCoeffs     on;
}*/

simulationType      LES;

LES
{
    LESModel        WALE;

    turbulence      on;

    printCoeffs     on;

    delta            cubeRootVol;

    kMin            1e-6;

    WALECoeffs
    {
        Ck              0.094;
        Ce              1.048;
    }
}

// ************************************************************************* //
